import React from 'react';
import Blog1 from '../img/blog1.png';
import Blog2 from '../img/blog2.png';
import '../css/blog.css'

export function BlogPage () {
    return <div className='container blog-page'>
        <h1>Блог</h1>
        <div><img src={Blog1} alt="alt"/>
        <h1>Как правильно менять струны</h1>
        <p>Начинающих гитаристов рано или поздно ждет столкновение с реальной жизнью, в которой приходится производить замену струн на акустической гитаре. Чаще всего, конечно, это происходит дома и лампово, но иногда приходится делать это в полевых условиях. Так что, если ты только вчера решил стать известным музыкантом, то лучше несколько заранее узнать о том, как правильно и как часто нужно менять струны.</p>
        <h3>Какие бывают</h3>
        <p>Струны делятся на два типа: металлические и синтетические. Первые изготавливаются из стали и имеют обмотку, которая, в свою очередь, делается из различных сплавов и наматывается на корн разными способами. А вторые – это в большинстве случаев нейлон.
            Если говорить грубо, то акустические гитары целенаправленно изготавливаются под определенные струны. А связано это с натяжением. Например, у металла оно намного сильнее, чем у нейлона. Следовательно, у гитар, предназначенных для установки на них стальных струн, укрепленный гриф и жесткий корпус. На такой инструмент, конечно, можно натянуть нейлон, то он вряд ли сможет удивить звуком, так как намного мягче металла. А вот обратную ситуацию, когда стальные струны ставятся на классическую гитару, предназначенную для синтетики, лучше не пробовать на практике, если, конечно, не преследуется цель испортить инструмент. Сильное натяжение может просто повести не предназначенный для этого гриф и вырвать нижний порожек.
            Отличить одну гитару от другой – проще простого. Нужно внимательно изучить нижний порожек и гриф. Нейлон крепится на специальном подструннике, а стальные струны – в корпусе гитары с дополнительным усилением внутри инструмента.
            Инструкция по замене струн на акустической гитаре. Помни, что струны меняются сразу все, даже если из строя вышла всего одна.</p>
        <h3>Смена металлических струн</h3>
        <p>Итак, если после предыдущего пункта, ты определил, что держишь в руках инструмент, для которого подходят металлические расходники и отмечаешь их полное или частичное отсутствие, то следует пройти следующие этапы установки струн.
            Купить подходящие струны. Можешь выбрать точно такие же, какие были в прошлый раз, а можешь попробовать что-нибудь новое. В этой статье описано какими они бывают.
            После необходимо ослабить колки на инструменте. Некоторые пользуются специальными приблудами, так называемыми, вертушками для струн, а другие полагаются на собственные руки. Что выбрать – решать тебе.
            После полного ослабления струны, необходимо полностью размотать ее и снять с колки.
            Как только работа с грифом была закончена, переходи к нижнему порожку. Необходимо вынуть пробки, удерживающие струну. Для этой процедуры тоже существует свои инструменты, но некоторые обходятся обычными плоскогубцами, хоть это и может внешний вид инструмента.
            После удаления пина, струна полностью достается из инструмента.
            Неплохо на этом этапе протереть инструмент от пыли, почистить гриф и корпус.</p>
        <h3>Смена нейлоновых струн</h3>
        <p>А если ты определил, что у тебя классическая гитара, с полным или частичным отсутствием струн, то для того, чтобы снова смочь играть на ней, стоит сделать следующие шаги.
            Как и в прошлом случае, все начинается с покупки струн. В этой статье можно почитать о том, как правильно выбирать синтетику.
            Как только новые расходники у тебя, можно начинать. Сначала нужно снять струны с акустической гитары. Аккуратно раскручивай колки, пока не достанешь кончик. Есть, конечно, более радикальный способ – просто перерезать струны. Но подобный подход не только может повредить инструменту, но и слегка подкорректировать музыканта. А точнее порезать руки и возможно другие части тела. Так что лучше выбирать более медленный, но безопасный способ.
            После раскручивания, переходим к нижнему порожку и развязываем узлы, освобождая струны.
            Чистим инструмент от пыли. Протереть нужно все и гриф, и корпус.
            Теперь продеваем один конец струны в порожек и фиксируем его узлом. Тебе повезло, если твой комплект расходников оснащен специальными шариками на концах. Тогда все элементарно – уплотнение не позволит струне покинуть инструмент. Но если нет, то придется немного потренироваться в вязании правильных узлов.
            Когда ты в предыдущем пункте достиг успеха, переходи к другому концу струны. Его необходимо вставить в отверстие в колке. А после – натягивай и проводи аналогичные процессы с другими струнами. Не забудь в самом конце обрезать торчащие концы.
            В случае с нейлоном, можно не следовать правилу не перетягивать, а даже противоречить ему. Синтетика в несколько раз мягче металла, и ее можно безболезненно натянуть чуть больше, чем требуется.</p>
        </div>
        <div>
        <img src={Blog2} alt="alt"/>
        <h1>Гитарные рифы</h1>
        <p>Рок-музыка — это давно нечто большее, чем вещь, которая злит родителей и призывает к бунту. Рок — это не только определенная «джинсовая» эстетика, в которой нашлось место и для ребят в галстуках вроде The Beattles, и раскрашенным брюнетам из Black Veil Brides. Но и те и другие в своем творчестве использовали гитарные риффы. Более того, весь рок — это на процентов 70, если не больше, состоит исключительно из забойных, хорошо запоминающихся риффов на гитарах. Далее мы рассмотрим, что такое рифф в рок-музыке, и с чем его едят, виды риффов, а также разберем табы наиболее известных, которые должен знать любой себя уважающий рокер. Итак, в путь.
        </p>
        <h3>Что такое гитарный рифф. Определение. Основные варианты использования</h3>
        <p>Риффом называют короткий постоянно повторяющийся музыкальный фрагмент. Рифф может быть как вступлением, так и любой другой частью песни: кульминацией, аккомпанементом, концовкой и т.д. В роке и блюзе риффы играются в нижнем регистре и используются, как аккомпанемент к песне, поэтому на гитаре чаще всего играются на нижних струнах и делает это ритм-гитарист.
            Некоторые риффы на гитаре стали настолько знаковыми, что по ним узнается целая песня. Например, Come as you are или Smoke On The Water.
        </p>
        <h3>Виды риффов</h3>
        <p>Риффы бывают одноголосные, аккордовые, в «открытых» тональностях, исполненные на основе квинты, блюзовые в тональности E-мажор, а также риффы с «педальным» тоном. Однако это условная классификация, так как один и тот же рифф может представлять собой комбинацию нескольких фрагментов. Придумать свой собственный рифф – это не так уж и сложно, главное – не бояться экспериментов.
        </p>
        <h3>Риффы в открытых тональностях (E, A или D)</h3>
        <p>Эти риффы используются в музыке, которая произошла от блюза, рок-н-ролла, блюз-рока, хард-рока, глэм-рока и т.д. Они исполняются на чистом звуке или с эффектом дисторшн. Часто во время игры применяется глушение правой рукой «palm muting». Основой для таких ритмических фигур служит power-аккорд, т.е. Аккорд, состоящий из основного тона и квинта с добавлением различных ступеней гаммы по ходу игры. Тональности, на которых играются рифы, в основном «открытые» — ми, ре, ля. Самая популярная тональность – это Ля мажор.
            Power-аккорд Ля в «открытой» позиции выглядит следующим образом:
            Первый (указательный) палец во время исполнения риффов глушит 3,2 и1 струны.
            Большой палец приглушает 6 струну.
        </p>
        </div>
    </div>
}